app/views/books/index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
						     	<i class="fa fa-heart" aria-hidden="true" style="color: red;"></i>
						     	<%= book.favorites.count %> いいね

SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---

					<td class="comment-count"><%= book.book_comments.count %>件のコメント</td>