app/controllers/books_controller.rb

  def create
  	@book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
    @book.user_id = current_user.id
  	if @book.save #入力されたデータをdbに保存する。
  		redirect_to book_path(@book.id), notice: "successfully created book!"#保存された場合の移動先を指定。
  	else
  		@books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "ららら"], ["body", "ラブソング"], ["user_id", 1], ["created_at", "2020-01-27 06:38:14.864944"], ["updated_at", "2020-01-27 06:38:14.864944"]]
SELECT "books".* FROM "books"